EDT/МПСтриж/src/InformationRegisters/ТранзакцииAssist/ТранзакцииAssist.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТранзакцииAssist</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>billnumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Оплачен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДатаТранзакции</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ТипОплаты</name>
    <type>
      <types>CatalogRef.ТипыОплат</types>
    </type>
  </resources>
  <resources>
    <name>Рейс</name>
    <type>
      <types>DocumentRef.Рейс</types>
    </type>
  </resources>
  <resources>
    <name>merchant_id</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.Водители</types>
    </type>
  </resources>
  <resources>
    <name>Экспедитор</name>
    <type>
      <types>CatalogRef.Экспедиторы</types>
    </type>
  </resources>
  <resources>
    <name>ТипОперации</name>
    <type>
      <types>EnumRef.ТипыОперацийAssist</types>
    </type>
  </resources>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.Заказ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/МПСтриж/src/CommonModules/УдаленноеЗакрытиеЭкипажейСервер/Module.bsl
Функция ПроверитьСтатусыНаНевыгруженностьВЦБ(ДатаПроверки) Экспорт
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	            |	ДанныеЗаказаВодителяИзменения.Ссылка.Ссылка КАК Данные,
	            |	ДанныеЗаказаВодителяИзменения.Ссылка.Реализация КАК Заказ
	            |ИЗ
	            |	Документ.ДанныеЗаказаВодителя.Изменения КАК ДанныеЗаказаВодителяИзменения
	            |ГДЕ
	            |	ДанныеЗаказаВодителяИзменения.Узел = &Узел
	            |	И ДанныеЗаказаВодителяИзменения.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон";
	Зап.УстановитьПараметр("ДатаНач", НачалоДня(ДатаПроверки));
	Зап.УстановитьПараметр("ДатаКон", КонецДня(ДатаПроверки));
	Зап.УстановитьПараметр("Узел", Константы.УзелПланаОбмена.Получить());
	
	Рез = Зап.Выполнить();
	
	Возврат Рез.Пустой();
КонецФункции	

Функция ПроверитьНаличиеНевыгруженныхТранзакцийAssist(ДатаПроверки) Экспорт
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	            |	ТранзакцииAssistИзменения.Заказ КАК Заказ
	            |ИЗ
	            |	РегистрСведений.ТранзакцииAssist.Изменения КАК ТранзакцииAssistИзменения
	            |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТранзакцииAssist КАК ТранзакцииAssist
	            |		ПО ТранзакцииAssistИзменения.Период = ТранзакцииAssist.Период
	            |			И ТранзакцииAssistИзменения.Заказ = ТранзакцииAssist.Заказ
	            |			И (ТранзакцииAssist.Оплачен = ИСТИНА)
	            |ГДЕ
	            |	ТранзакцииAssistИзменения.Узел = &Узел
	            |	И ТранзакцииAssistИзменения.Период МЕЖДУ &ДатаНач И &ДатаКон";
	Зап.УстановитьПараметр("ДатаНач", НачалоДня(ДатаПроверки));
	Зап.УстановитьПараметр("ДатаКон", КонецДня(ДатаПроверки));
	Зап.УстановитьПараметр("Узел", Константы.УзелПланаОбмена.Получить());
	
	Рез = Зап.Выполнить();
	
	Возврат Рез.Пустой();
КонецФункции
